---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetProperties.Size
source: html/6709faa0-bbd6-3a10-9269-67b9d1af11a6.htm
---
# Autodesk.Revit.DB.Visual.AssetProperties.Size Property

The number of the AssetProperty(s) in the object.

## Syntax (C#)
```csharp
public int Size { get; }
```